Статистика работы механизмов/Конфигурация/DataProcessors/_ЗапросДанныхПоСделкамРПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ЗапросДанныхПоСделкамРПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СделкиРПС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Флаг</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ЗапросДанныхПоСделкамРПС/Forms/Форма/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);

	// начальное заполнение формы
	Объект.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");		
	Объект.Дата 		= Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДата(), -2);
	
	ОбновитьШаблонНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
	ОбновитьСделкиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаСформировать(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	ДанныеДляЗаполнения = Неопределено;
	
	СессияСбораСтатистики 	= "";
	ПолноеИмяОтчета 		= "";
	
	ЗарегистрироватьНачалоСессииНаСервере(ПолноеИмяОтчета, СессияСбораСтатистики);
	Отказ = Ложь;
	
	НаименованиеБрокера = ПолучитьНаименованиеБрокера(Объект.Брокер, Объект.Дата);
	МассивСтрок = ПолучитьМассивДанныхНаСервере(Отказ);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Брокер",					НаименованиеБрокера);
	Реквизиты.Вставить("ДатаСделок", 				Формат(Объект.Дата, "ДФ=dd.MM.yyyy"));
	Реквизиты.Вставить("Ответственный", 			СокрЛП(Подписант));
	Реквизиты.Вставить("ДолжностьОтветственного", 	СокрЛП(ДолжностьПодписанта));
	
	Если МассивСтрок.Количество() = 0 Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайлаШаблона = ПолучитьИмяВременногоФайла("docx");
	Шаблон.Записать(ИмяФайлаШаблона);
		
	Отказ = Ложь;
	
	Попытка
		
		// создадим документ MS Word на основании сохраненного шаблона
		WordApp = Новый COMОбъект("Word.Application");
		
		NewDoc = WordApp.Application.Documents.Add(ИмяФайлаШаблона, False, , Истина);
		
		WordVars = NewDoc.Variables;
		Для Каждого Реквизит Из Реквизиты Цикл
			WordVars.Item(Реквизит.Ключ).Value = Реквизит.Значение;
		КонецЦикла;
									
		NewDoc.Bookmarks("ТекстСделки").Range.Select();
		Selection = WordApp.Application.Selection;
		
		КоличествоСтрок = МассивСтрок.Количество();
		Для Каждого ТекстСделки Из МассивСтрок Цикл
			Selection.TypeText(ТекстСделки);
			Selection.TypeParagraph();
		КонецЦикла;		
		
		// Выделяем выведенные параграфы
		Selection.MoveUp(4,КоличествоСтрок,1);
		ListTemplate = WordApp.ListGalleries(2).ListTemplates(1).ListLevels(1);
		ListTemplate.NumberFormat = "%1.";
		ListTemplate.NumberStyle = 0;
		Selection.Range.ListFormat.ApplyListTemplateWithLevel(WordApp.ListGalleries(2).ListTemplates(1));
		
		NewDoc.Fields.Update();
		
		WordApp.Application.Visible = Истина;
		
		ОбработкаПрерыванияПользователя();
				
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(),,,,Отказ);	
	КонецПопытки;
	
	// удалим файл шаблона
	Попытка
		УдалитьФайлы(ИмяФайлаШаблона);
	Исключение
	КонецПопытки;
	
	Если Отказ Тогда
		ПоказатьПредупреждение(,"Печать документа завершилась с ошибкой");
	Иначе
		
	КонецЕсли;
	
	Если Не Отказ Тогда
		WordApp.Application.Activate();
	КонецЕсли;  
	
	ЗарегистрироватьОкончаниеСессииНаСервере(ПолноеИмяОтчета, СессияСбораСтатистики);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	
	ОбработатьФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	
	ОбработатьФлажки(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбновитьСделкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ДолжностьПодписанта = "";
	Подписант 			= "";
	
	ОбновитьШаблонНаСервере();
	
	ОбновитьСделкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
	
	ОбновитьСделкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СделкиРПССделкаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантНачалоВыбора(ЭтаФорма, Элемент, Подписант, Объект.Организация, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	РаботаСОтчетамиКлиент.ПодписантОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, СтруктураДанныхКонтактногоЛица, Объект.Организация);
	Если СтруктураДанныхКонтактногоЛица <> Неопределено Тогда
		ДолжностьПодписанта = СтруктураДанныхКонтактногоЛица.Должность;
		Подписант 			= СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаСервере
Функция ПолучитьМассивДанныхНаСервере(Отказ)
			
	#Область Текст_Запроса
	        	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкиРПС.Сделка КАК Сделка,
		|	СделкиРПС.Флаг КАК Флаг,
		|	СделкиРПС.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ _СделкиРПС
		|ИЗ
		|	&СделкиРПС КАК СделкиРПС
		|ГДЕ
		|	СделкиРПС.Флаг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА ""акций""
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|			ТОГДА ""векселей""
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ""депозитарных расписок""
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Доли
		|			ТОГДА ""долей""
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Закладные
		|			ТОГДА ""закладных""
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ""ипотечных сертификатов участия""
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ""облигаций""
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА ""паев""
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ПроизводныеФинансовыеИнструменты
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Фьючерс)
		|						ТОГДА ""фьючерсов""
		|					КОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ПроизводныеФинансовыеИнструменты).ТипПроизводногоФинансовогоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыПроизводныхФинансовыхИнструментов.Опцион)
		|						ТОГДА ""опционов""
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипЦБ,
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|			ТОГДА РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Эмитент.Наименование)
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.Наименование)
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.Наименование)
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Доли
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо.Наименование)
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.Наименование)
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.Наименование)
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Закладные
		|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Закладные).Банк.Наименование)
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК КраткоеНаименованиеЭмитента,
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|				И ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер <> """"
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|				И ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер <> """"
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|				И ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер <> """"
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|				И ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер <> """"
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|				И ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Номер <> """"
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Номер
		|		КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|				И ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер <> """"
		|			ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер
		|		ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|	КОНЕЦ КАК РегистрационныйНомер,
		|	СделкаЦенныеБумаги.Количество КАК Количество,
		|	СделкаЦенныеБумаги.Ссылка.НомерСделки КАК НомерСделки,
		|	СделкаЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СделкаЦенныеБумаги.Ссылка.КонтрагентНаБирже КАК КонтрагентНаБирже,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.НомерДоговора КАК НомерДоговора,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.ДатаЗаключения КАК ДатаЗаключения,
		|	ВЫБОР
		|		КОГДА СделкаЦенныеБумаги.Ссылка.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Покупка)
		|			ТОГДА ""покупке""
		|		ИНАЧЕ ""продаже""
		|	КОНЕЦ КАК ВидСделки
		|ИЗ
		|	Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СделкиРПС КАК _СделкиРПС
		|		ПО СделкаЦенныеБумаги.Ссылка = _СделкиРПС.Сделка
		|			И (СделкаЦенныеБумаги.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|				КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Векселя
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|				КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ДепозитарныеРасписки
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
		|				КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Доли
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо
		|				КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|				КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|				КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Закладные
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Закладные).Банк.ЮрФизЛицо
		|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаОкончания, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследнихISIN
		|		ПО СделкаЦенныеБумаги.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихISIN.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&ДатаОкончания, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА СделкаЦенныеБумаги.ЦеннаяБумага ССЫЛКА Справочник.Паи
		|					ТОГДА ВЫРАЗИТЬ(СделкаЦенныеБумаги.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаОкончания, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследнихКодНаММВБ
		|		ПО СделкаЦенныеБумаги.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|				&ДатаОкончания,
		|				Организация = &Организация
		|					И Брокер = &Брокер) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ПО СделкаЦенныеБумаги.Ссылка.СчетДоверительногоУправления = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления
		|			И СделкаЦенныеБумаги.Ссылка.Брокер = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер
		|
		|УПОРЯДОЧИТЬ ПО
		|	_СделкиРПС.НомерСтроки");
	
	#КонецОбласти 
	
	Запрос.УстановитьПараметр("ДатаНачала", 	НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", 	КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);  		
	Запрос.УстановитьПараметр("Брокер", 		Объект.Брокер);  		
	
	Запрос.УстановитьПараметр("СделкиРПС",		Объект.СделкиРПС.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	
	Если Выборка.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат Результат;
	КонецЕсли;	      
	                     	
	Пока Выборка.Следующий() Цикл		
		Результат.Добавить("По " + Выборка.ВидСделки + " " + Выборка.ТипЦБ + " " + Выборка.КраткоеНаименованиеЭмитента + ", регистрационный номер " + Выборка.РегистрационныйНомер + " в кол-ве " + Формат(Выборка.Количество, "ЧФ=Ч") + " шт, номер сделки " + Выборка.НомерСделки + " в рамках Соглашения о брокерском обслуживании № " + Выборка.НомерДоговора + " от " + Формат(Выборка.ДатаЗаключения, "ДФ=dd.MM.yyyy") + ";");
	КонецЦикла;
	
	Возврат Результат;	
	
КонецФункции

&НаСервере
Процедура ЗарегистрироватьНачалоСессииНаСервере(ПолноеИмяОтчета, СессияСбораСтатистики)
	
	// Фиксируем старт операции
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики();
	
	ПолноеИмяОтчета = РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя();
	СессияСбораСтатистики   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		ПолноеИмяОтчета,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьОкончаниеСессииНаСервере(ПолноеИмяОтчета, СессияСбораСтатистики)

	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПолноеИмяОтчета, СессияСбораСтатистики); 	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыВыполненияДляСбораСтатистики()
	
	СтрСохраняемыеДанные = "Дата,Организация,Брокер";
	ПараметрыОтчета = Новый Структура(СтрСохраняемыеДанные);
	ЗаполнитьЗначенияСвойств(ПараметрыОтчета, Объект);
	
	Описание = "";
	
	Для каждого Реквизит Из СтрРазделить(СтрСохраняемыеДанные, ",") Цикл
	
		Описание = Описание + Символы.ПС + Реквизит + ": " + ПараметрыОтчета[Реквизит];
	
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции // ПолучитьПараметрыВыполненияДляСбораСтатистики

&НаСервере 
Процедура ОбновитьШаблонНаСервере()

	ЭтоТраст = Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ");
	Шаблон = РеквизитФормыВЗначение("Объект").ПолучитьМакет(?(ЭтоТраст, "ШаблонТраст", "ШаблонРЭМ"));
	
КонецПроцедуры

&НаСервере 
Процедура ОбновитьСделкиНаСервере()
		
	Если Не ЗначениеЗаполнено(Объект.Брокер) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СделкиРПС.Очистить();
	
	ИсключаемыеКодыРасчетовНаБирже = Новый Массив;
	ИсключаемыеКодыРасчетовНаБирже.Добавить("Z0");
	
	#Область Текст_Запроса
	        	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделка.Ссылка КАК Сделка,
		|	Сделка.КонтрагентНаБирже КАК Контрагент,
		|	ИСТИНА КАК Флаг
		|ИЗ
		|	Документ.Сделка КАК Сделка
		|ГДЕ
		|	Сделка.Организация = &Организация
		|	И Сделка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Сделка.РежимПереговорныхСделок
		|	И Сделка.Брокер = &Брокер
		|	И НЕ Сделка.КодРасчетовНаБирже В (&ИсключаемыеКодыРасчетовНаБирже)
		|	И Сделка.Проведен
		|	И НЕ Сделка.ВыкупЭмитентом");
	
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ДатаНачала", 					НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", 					КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Организация", 					Объект.Организация);  		
	Запрос.УстановитьПараметр("Брокер", 						Объект.Брокер);  		
	Запрос.УстановитьПараметр("ИсключаемыеКодыРасчетовНаБирже",	ИсключаемыеКодыРасчетовНаБирже);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Формат(Объект.Дата, "ДФ=dd.MM.yyyy") + " нет сделок РПС");
		Возврат;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СделкиРПС.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФлажки(Установить)
	
	Для Каждого ТекСтрока Из Объект.СделкиРПС Цикл
		ТекСтрока.Флаг = Установить;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаименованиеБрокера(Брокер, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК Наименование
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			&Дата,
		|			ЮрФизЛицо = &Брокер
		|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних";
		
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Брокер", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Брокер, "ЮрФизЛицо"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаименованиеБрокера = "<Брокер не найден>";
		
	Если Выборка.Следующий() Тогда
		НаименованиеБрокера = Выборка.Наименование;	
	КонецЕсли;                                     	

	Возврат НаименованиеБрокера;
	
КонецФункции

#КонецОбласти
